examples/phtEnthalpyFoam/sutherlandViscosity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     phtEnthalpyFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         #eval "3600*10";//144000;//108000;//36000;//

deltaT          0.1;//30;//0.1;

writeControl    adjustableRunTime;//runTime;

writeInterval   3600;//3600;

purgeWrite      0;

writeFormat     ascii;

writePrecision 9;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;//no;

maxCo           100;
maxDeltaT	10;

functions 
{ 
//    #includeFunc  CourantNo;
    #includeFunc  singleGraph
    #includeFunc  probes
}

// ************************************************************************* //
